app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY created_at DESC
---
 	def index
 		@recipe = Recipe.all.order("created_at DESC")

INSERT INTO "recipes" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		@recipe = Recipe.new(recipe_params)

		if @recipe.save

UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = 1  [["description", "test the form making with sim[le_form and haml but updated\r\n\r\n"], ["updated_at", Thu, 19 Nov 2015 10:01:55 UTC +00:00]]
---
	def update
		if @recipe.update(recipe_params)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
	def find_recipe
		@recipe = Recipe.find(params[:id])